[
    {
      "name": "Alex Vranic",
      "id": "623eddb5c8d65d7e7725ca92",
     
      "review":"Very disappointed . Bought bike brand new . Had trouble for the first 5 months , hardly drove it due to problem . Wrote ktm . Replied twice , said they were going to see about compensation for putting us out so much .",
      "Rating": "3/5"
    },
    {
      "name": "Roger",
      "id": "623eddb5d268fa973c1c0551",
      
      "review":" 790 Adventure suspension is appalling. Especially the forks which rattle and clunk and the damping is all wrong. Zero adjustment.",
      "Rating": "4/5"
    },
    {
      "name": "John Uren",
      "id": "623eddb549cf0a9833f90fdc",
      
      "review":"Extremely poor and unsatisfactory customer service - faceless organisation. Wrote to them regarding dissapointment of buying a Premium £15K motorcycle, with no owners manual supplied. Their response sent me to a link, where I was told I could obtain a manual - turned out to be a  selling the manual for £30 !",
      "Rating": "5/5"
    },
    {
      "name": "Silviu Tranda",
      "id": "623eddb50ec835c9ec95b8d8",
      
      "review":"Wrost brand ever try. I have my 125 duke 2019 in service from 1st August and is 24 september! 2 months for 1 part from piston! This never happen with other brands! So manny dealers in Europe and they don't have parts for exchange. They keep giving me dates like 20th august, 15th to 20th September than, the part arrive on 23th call us on 25, today they just told me that they can't give a date. Unprofessional, i will change the brand for sure",
      "Rating": "3/5"
    },
    {
      "name": "Tanvi juhjh",
      "id": "623eddb5342ddf8e9569f04c",
      
      "review":" I have had no problems with KTM, love their motorcycles and Powerparts options :)",
      "Rating": "3/5"
    },
    {
      "name": "TAleban x",
      "id": "623eddb5ce95394072b977aa",
      
      "review":"I have had a few of these over the years, two date and one no date, and have to say they are the best Rolex to invest in and wear. They are perfect for everyday use and dependable as the day is long.",
      "Rating": "5/5"
    }
    
  ]